AlyMetwaly/Embedded_AI/final_models/STM32F401/gru_l1_n12/gru_l1_n12.ioc
STMicroelectronics.X-CUBE-AI.3.4.0.IPParameters=XAaCUBEAaAICcArtificialOoIntelligenceJjCore,ApplicationCcArtificialOoIntelligenceJjApplication,ModelHashList,ModelNameList,ModelName-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelActualCompression-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelCompression-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelRamOccupation-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelType-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelKind-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelStructureFile-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelName-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelActualCompression-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelCompression-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelRamOccupation-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelName-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelActualCompression-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelCompression-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelRamOccupation-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelType-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelKind-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelStructureFile-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelName-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelActualCompression-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelCompression-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelRamOccupation-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelType-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelKind-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelName-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150,ModelActualCompression-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150,ModelCompression-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150,ModelRamOccupation-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150,ModelType-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150,ModelKind-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150,ModelType-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelKind-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelStructureFile-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelStructureFile-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelFlashOccupation-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelMacc-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6,ModelFlashOccupation-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelMacc-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d,ModelFlashOccupation-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelMacc-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f,ModelFlashOccupation-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelMacc-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72,ModelName-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelActualCompression-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelCompression-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelRamOccupation-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelName-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelActualCompression-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelCompression-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelRamOccupation-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelType-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelKind-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelStructureFile-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelType-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelKind-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelStructureFile-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelFlashOccupation-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelMacc-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c,ModelFlashOccupation-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelMacc-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8,ModelName-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelActualCompression-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelCompression-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelRamOccupation-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelType-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelKind-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelStructureFile-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelFlashOccupation-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelMacc-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819,ModelName-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelActualCompression-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelCompression-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelRamOccupation-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelType-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelKind-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelStructureFile-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelFlashOccupation-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelMacc-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f,ModelName-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelActualCompression-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelCompression-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelRamOccupation-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelKind-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelType-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelStructureFile-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelName-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelActualCompression-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelCompression-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelRamOccupation-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelFlashOccupation-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelMacc-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6,ModelType-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelKind-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelStructureFile-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelFlashOccupation-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelMacc-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716,ModelName-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelActualCompression-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelCompression-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelRamOccupation-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelKind-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelType-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelStructureFile-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelName-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelActualCompression-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelCompression-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelRamOccupation-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelFlashOccupation-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelMacc-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6,ModelKind-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelType-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelStructureFile-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelName-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelActualCompression-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelCompression-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelRamOccupation-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelFlashOccupation-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelMacc-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67,ModelKind-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelType-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelStructureFile-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelName-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelActualCompression-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelCompression-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelRamOccupation-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelFlashOccupation-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelMacc-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d,ModelType-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelKind-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelStructureFile-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelName-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelActualCompression-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelCompression-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelRamOccupation-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelFlashOccupation-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelMacc-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d,ModelType-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelKind-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelStructureFile-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelFlashOccupation-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelMacc-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f,ModelName-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelActualCompression-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelCompression-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelRamOccupation-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelType-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelKind-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelStructureFile-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelFlashOccupation-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,ModelMacc-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad,HeapSize,StackSize
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=7.964
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=7.295
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=7.948
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=6.294
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=7.966
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=7.941
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=7.97
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=7.974
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=7.004
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=6.757
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150=0.0
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=7.004
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=7.307
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=0.0
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=7.952
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=0.0
STMicroelectronics.X-CUBE-AI.3.4.0.ModelActualCompression-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=7.976
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150=0
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=0
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelCompression-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=8
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=315880
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=85129
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=713750
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=202440
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=647630
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=333000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=76879
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=153690
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=89250
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=186190
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=89250
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=169940
