AlyMetwaly/Embedded_AI/final_models/STM32F401/gru_l1_n12/gru_l1_n12.ioc
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=5289999
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=324440
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=109879
STMicroelectronics.X-CUBE-AI.3.4.0.ModelFlashOccupation-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=614570
STMicroelectronics.X-CUBE-AI.3.4.0.ModelHashList=eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelKind-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=KERAS
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=643969
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=158977
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=1452289
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=326209
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=1320705
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=676993
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=156865
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=313729
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=160033
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=322049
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=160033
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=317889
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=1386497
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=660481
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=562093
STMicroelectronics.X-CUBE-AI.3.4.0.ModelMacc-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=1254913
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=fnn_l2_n128
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=fnn_l3_n32
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=fnn_l4_n265
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=fnn_l4_n64
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=fnn_l2_256
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=fnn_l4_n128
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=fnn_l1_n_32
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=fnn_l1_64
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=fnn_l4_n32
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=fnn_l3_64
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150=1563384616262
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=fnn_l4_n32
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=fnn_l1_n64
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=fnn_l3_256
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=fnn_l3_128
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=gru_l1_n12
STMicroelectronics.X-CUBE-AI.3.4.0.ModelName-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=fnn_l1_256
STMicroelectronics.X-CUBE-AI.3.4.0.ModelNameList=gru_l1_n12
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=1000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=260
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=2000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=516
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=2000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=1000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=136
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=264
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=260
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=516
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150=0
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=260
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=516
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=2000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=1000
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=56
STMicroelectronics.X-CUBE-AI.3.4.0.ModelRamOccupation-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=1009
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_2_neurons_128.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_3_neurons_32.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_4_neurons_256.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_4_neurons_64.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_2_neurons_256.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_4_neurons_128.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_1_neurons_32.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_1_neurons_64.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_4_neurons_32.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_3_neurons_64.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_4_neurons_32.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_2_neurons_64.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_3_neurons_256.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_3_neurons_128.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Melexis/new_test_set/models/original_data/gru_batch_128_layers_1_lback_20_neurons_12.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelStructureFile-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=/Users/metwaly_aly/OneDrive - Helvar Oy Ab/Radar/Radar_AWS/models/FNN/ffn_batch_256_layers_1_neurons_256.h5
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-0300c07a2a296530ba372e5e13f5f2596c9611665aa2a52101de376cc3cf4819=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-0ad0aef2278ab89b476bf46b99b20f0236343d1ade165270370e2bc28289e7e6=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-451048d50251f6c55602449ac6d5e045f2520e84b01263c16afaa52cb8cf1cad=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-451f6b468d8d4d67414bbc0c61efc5145c6c2e51e33912c2624550f8d10c313d=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-520a5697816a877df81f409a956b638e542396f933aafe649fb24eb0bb01da1f=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-58063cc35d020b4426afe283e867796bfc4c78f4b9a6201fb0139c17aa1afe4f=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-60423bab84e63d30d62dc3f173754bfa1d6fcb865b35e988091dab5cbcc6ec72=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-8328d655b4684f8fd0af6e883d8eb0baeae7e6ee45d0b31c43a2d4c55ca8c58f=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-971fe6519f1e279c00cc32ad2617e451425b93433b9b9fce108f5d0d91a5024d=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-9b85a42bf3a80c1e53bf7b102c55c322a4c66974530fa5bcb43e8a20cbbf1716=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-ad3d97246a71f772348e238be11d9c38735f0f3438b941530a5a824a859a3150=Saved model
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-b304958811a8f7185f59400a692d675a76a84ad8b18b279878ded74f3803a75c=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-c8ee618b7b438fd0dbf6cdcd38eb6a34516aca9bf6860d10b5babcaa226f83d8=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-c97b595e6dd13071dc78b8e08ed1edfec34a2388a1ecc3fd21efef86bfb23d67=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-e0f6e13d2a9c47247180980761e90d70a427f91ab0b061cebb3ffca9c20b48c6=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-eaa4dbb50f7e55cf418e7604095da5f27c60d98579f82e636c7acad9b9e0cc9d=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.ModelType-eb36fff5ecdd041139d5065a4ffc0284eb9d0bfefe3f94bea6bfe6d829c683f6=Model and Topology
STMicroelectronics.X-CUBE-AI.3.4.0.StackSize=0x4000
STMicroelectronics.X-CUBE-AI.3.4.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.api=Unknown
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.component=
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.condition=
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.i2caddr=0
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.i2creg=
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.instance=USART2
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.ip=USART
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.mode=Asynchronous
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.name=COM Port
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.semaphore=
STMicroelectronics.X-CUBE-AI.3.4.00.BSP.solution=USART2
STMicroelectronics.X-CUBE-AI.3.4.0_ArtificialOoIntelligenceJjApplication_RteComponent0=\#define AI_SYSTEM_PERFORMANCE
STMicroelectronics.X-CUBE-AI.3.4.0_ArtificialOoIntelligenceJjApplication_RteComponentsize=1
STMicroelectronics.X-CUBE-AI.3.4.0_ArtificialOoIntelligenceJjXAaCUBEAaAI_RteComponentsize=0
STMicroelectronics.X-CUBE-AI.3.4.0_MwName0=X-CUBE-AI
STMicroelectronics.X-CUBE-AI.3.4.0_MwName1=Application
STMicroelectronics.X-CUBE-AI.3.4.0_NumberOfMw=2
STMicroelectronics.X-CUBE-AI.3.4.0_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;ApplicationCcArtificialOoIntelligenceJjApplication\:SystemPerformance;
STMicroelectronics.X-CUBE-AI.3.4.0_description=Artificial Intelligence
STMicroelectronics.X-CUBE-AI.3.4.0_license=SLA0048.txt
STMicroelectronics.X-CUBE-AI.3.4.0_supportedCore=Cortex-M4;Cortex-M7;
USART2.IPParameters=VirtualMode
USART2.VirtualMode=VM_ASYNC
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_3.4.0.Mode=ArtificialOoIntelligenceJjApplication
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_3.4.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_3.4.0
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_3.4.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_3.4.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_3.4.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=NUCLEO-F401RE
boardIOC=true
